app/controllers/movies_controller.rb

  def update
    @movie.update(movie_params)
---
UPDATE "movies" SET "description" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["description", "É ruim"], ["updated_at", "2017-01-27 12:24:36.109290"], ["id", 1]]

  def create
    @movie = Movie.new(movie_params)
    if @movie.save
---
INSERT INTO "movies" ("title", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Alladin 2"], ["description", "Olá"], ["release_date", "2017-01-27 00:00:00.000000"], ["created_at", "2017-01-27 12:16:26.129477"], ["updated_at", "2017-01-27 12:16:26.129477"]]

  def delete
  @movie = params['id']
    if Movie.destroy(@movie)
---
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 2]]

  def set_movie
    id = params['id']
    @movie = Movie.find(id)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", nil]]